Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraints Class
 The AnalysisRestraints class contains analysis restraints information for an analysis part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisRestraints
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisRestraints
Public Class AnalysisRestraints
The AnalysisRestraints type exposes the following members.
Constructors
Name | Description
AnalysisRestraints
 Creates a new analysis restraints instance.
Top
Properties
Name | Description
End
 Data related to the second part end.
Start
 Data related to the first part end.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace